In [1]:
import pandas as pd

In [3]:
df = pd.read_excel("Excel_data.xlsx")
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [5]:
# apply() function lets you run the custom function on our dataset
df1 = df.copy()
df2 = df.copy()

In [6]:
# Query: Today the CEO of the company is very happy.
# He decided to double the salary

# without using apply() function
df2['salary'] = df2['salary'] * 2
df2

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  369036
1      2  sophia     20.0              Boxer  239144
2      3       jake  38.0          Scientist  349794
3      4      Rocky  56.0               Chef  235840
4      4      Rocky  56.0               Chef  235840
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  275858
496  497   Sherlock  46.0              Boxer   79740
497  498   Sherlock  47.0          Detective  331902
498  499     Olivia  55.0           Comedian  385236
499  500   Sherlock  59.0  Software Engineer  389772

[500 rows x 5 columns]

In [7]:
# with the help of apply() function 
df1['salary'] = df1.salary.apply(lambda x : x * 2)
df1

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  369036
1      2  sophia     20.0              Boxer  239144
2      3       jake  38.0          Scientist  349794
3      4      Rocky  56.0               Chef  235840
4      4      Rocky  56.0               Chef  235840
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  275858
496  497   Sherlock  46.0              Boxer   79740
497  498   Sherlock  47.0          Detective  331902
498  499     Olivia  55.0           Comedian  385236
499  500   Sherlock  59.0  Software Engineer  389772

[500 rows x 5 columns]

In [9]:
# Query: Create a new column "Category"
# 'Senior' if salary > 100000 otherwise 'Junior'
df1['Category'] = df1.apply(lambda x : 'Senior' if x['salary'] > 100000 else 'Junior', axis = 1)
df1

      ID       Name   Age         Profession  salary Category
0      1     olivia  23.0            Teacher  369036   Senior
1      2  sophia     20.0              Boxer  239144   Senior
2      3       jake  38.0          Scientist  349794   Senior
3      4      Rocky  56.0               Chef  235840   Senior
4      4      Rocky  56.0               Chef  235840   Senior
..   ...        ...   ...                ...     ...      ...
495  496       John  45.0              Boxer  275858   Senior
496  497   Sherlock  46.0              Boxer   79740   Junior
497  498   Sherlock  47.0          Detective  331902   Senior
498  499     Olivia  55.0           Comedian  385236   Senior
499  500   Sherlock  59.0  Software Engineer  389772   Senior

[500 rows x 6 columns]

In [10]:
# map() function is mainly used for mapping of values
df1.Profession.unique()

array(['Teacher', '      Boxer', 'Scientist', 'Chef', 'Doctor', 'Artist',
       'Comedian', 'Software Engineer', 'Detective', 'Pilot'],
      dtype=object)

In [11]:
df1['Profession'] = df1.Profession.str.strip()

In [12]:
df1.Profession.unique()

array(['Teacher', 'Boxer', 'Scientist', 'Chef', 'Doctor', 'Artist',
       'Comedian', 'Software Engineer', 'Detective', 'Pilot'],
      dtype=object)

In [ ]:
map_dict = {
    'Teacher' : 'Education',
    'Boxer' : 'Sports',
    'Scientist' : 'Research',
    'Chef' : 'Cooking',
    'Doctor' : 'Health',
    'Artist' : 'Art',
    'Comedian' : 'Laughing',
    'Software Engineer' : 'Coding',
    'Detective' : 'Spying',
    'Pilot' : 'Fly'
}
df1['New Profession'] = df1.Profession.